"""
Есть два файла: в одном хранятся ФИО пользователей сайта, а в другом  — данные об их хобби.
    Известно, что при хранении данных используется принцип: одна строка — один пользователь.
    Разделитель между значениями — запятая.
    Написать код, загружающий данные из обоих файлов и сохраняет объединенные данные в новый файл.
    Хобби пишем через двоеточие и пробел после ФИО.
    Реализовать интерфейс командной строки, чтобы можно было задать имя обоих исходных файлов и имя выходного файла.
"""